bench_results/bench_epoll_20260313_090606.txt
Running 10s test @ http://127.0.0.1:8000/plaintext
  16 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.14ms    1.80ms  44.37ms   94.50%
    Req/Sec    12.66k     2.08k   16.27k    81.19%
  Latency Distribution
     50%    4.88ms
     75%    5.32ms
     90%    5.93ms
     99%   12.12ms
  2015979 requests in 10.01s, 298.00MB read
Requests/sec: 201309.20
Transfer/sec:     29.76MB